<?php

use App\Models\Branch\Branch;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\Log;

class BranchesTableSeeder extends Database\Seeds\BaseSeeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $vars = [
            [
                'id' => '275460ac-0795-11ea-9490-b06ebfbfa715',
                'code' => '001-002',
                'code_map' => '6954205146',
                'acc_number' => '40404972900020000007',
                'name' => 'Филиали ЧСК "Бонки Эсхата" дар ш. Душанбе',
                'address' => 'г. Душанбе, куч. Н.Каробоев 16',
                'branch_user_id' => '84197204',
            ],
            [
                'id' => '5d8b062c-0795-11ea-9490-b06ebfbfa715',
                'code' => '001-003',
                'code_map' => '6954205616',
                'acc_number' => '40404972400030000005',
                'name' => 'Филиали ЧСК "Бонки Эсхата" дар в. Хатлон',
                'address' => 'г. Кургонтеппа, ул. Норинова 1а',
                'branch_user_id' => '94834257',
            ],
            [
                'id' => '60dc6052-0795-11ea-9490-b06ebfbfa715',
                'code' => '001-004',
                'code_map' => '6955342938',
                'acc_number' => '40404972500040000005',
                'name' => 'Филиали ЧСК "Бонки Эсхата" дар ш. Хучанд',
                'address' => 'г. Хучанд, ул.Ленина 40',
                'branch_user_id' => '55126912',
            ],
            [
                'id' => '6366df18-0795-11ea-9490-b06ebfbfa715',
                'code' => '001-005',
                'code_map' => '6954763114',
                'acc_number' => '40404972200050000007',
                'name' => 'Филиали ЧСК "Бонки Эсхата" дар ш. Истаравшан',
                'address' => 'г. Истаравшан, ул. Рохи Ленин 12 "б"',
                'branch_user_id' => '109485286',
            ],
            [
                'id' => '6913f0a5-0795-11ea-9490-b06ebfbfa715',
                'code' => '001-006',
                'code_map' => '6954893313',
                'acc_number' => '40404972300060000007',
                'name' => 'Филиали ЧСК "Бонки Эсхата" дар ш. Исфара',
                'address' => 'г. Исфара, Маркази 29\1',
                'branch_user_id' => '149239583',
            ],
            [
                'id' => '6c62638d-0795-11ea-9490-b06ebfbfa715',
                'code' => '001-007',
                'code_map' => '6954978219',
                'acc_number' => '40404972100070000006',
                'name' => 'Филиали ЧСК "Бонки Эсхата" дар ш. Панчакент',
                'address' => 'г. Панчакент, пр.Рудаки-97',
                'branch_user_id' => '164385383',
            ],
            [
                'id' => '6ee16809-0795-11ea-9490-b06ebfbfa715',
                'code' => '001-008',
                'code_map' => '6955041337',
                'acc_number' => '40404972000080000002',
                'name' => 'Филиали ЧСК "Бонки Эсхата" дар ш. Конибодом',
                'address' => 'г. Конибодом, ул.Ленина 348',
                'branch_user_id' => '130350411',
            ],
            [
                'id' => '728d1791-0795-11ea-9490-b06ebfbfa715',
                'code' => '001-009',
                'code_map' => '6955176747',
                'acc_number' => '40404972900090000008',
                'name' => 'Филиали ЧСК "Бонки Эсхата" дар ш. Бустон',
                'address' => 'г. Бустон, ул. Мирзо Турсунзода 8а',
                'branch_user_id' => '62746007',
            ],
            [
                'id' => '7743145c-0795-11ea-9490-b06ebfbfa715',
                'code' => '001-010',
                'code_map' => '6955253998',
                'acc_number' => '40404972500100000013',
                'name' => 'Филиали ЧСК "Бонки Эсхата" дар нохияи Ашт',
                'address' => 'Аштский район, п.Дусти, ул.Сомони 38',
                'branch_user_id' => '66146891',
            ],
            [
                'id' => '7ae22303-0795-11ea-9490-b06ebfbfa715',
                'code' => '001-011',
                'code_map' => '6954655538',
                'acc_number' => '40404972600110000013',
                'name' => 'Филиали ЧСК "Бонки Эсхата" дар райони Мастчох',
                'address' => 'Матчинский район, пос. Бустон ул. И. Сомони 24',
                'branch_user_id' => '66143802',
            ],
            [
                'id' => '7dd59867-0795-11ea-9490-b06ebfbfa715',
                'code' => '001-013',
                'code_map' => '6955393571',
                'acc_number' => '40404972800130000013',
                'name' => 'Филиали ЧСК "Бонки Эсхата" дар райони Ч. Расулов',
                'address' => 'Дж. Расуловский район, ул Нурматов 1',
                'branch_user_id' => '66144024',
            ],
            [
                'id' => '807de23e-0795-11ea-9490-b06ebfbfa715',
                'code' => '001-014',
                'code_map' => '6955457131',
                'acc_number' => '40404972900140000013',
                'name' => 'Филиали ЧСК "Бонки Эсхата" дар райони Ёвон',
                'address' => 'г. Яван, ул. Гагарина 2а',
                'branch_user_id' => '72060521',
            ],
            [
                'id' => '848c0717-0795-11ea-9490-b06ebfbfa715',
                'code' => '001-015',
                'code_map' => '6955531254',
                'acc_number' => '40404972000150000013',
                'name' => 'Филиали ЧСК "Бонки Эсхата" дар ш. Турсунзода',
                'address' => 'г. Турсунзода, ул. И.Сомони 55',
                'branch_user_id' => '72060572',
            ],
            [
                'id' => '87886d08-0795-11ea-9490-b06ebfbfa715',
                'code' => '001-016',
                'code_map' => '6955619061',
                'acc_number' => '40404972400160000014',
                'name' => 'Филиали ЧСК "Бонки Эсхата" дар райони Вахдат',
                'address' => 'г. Вахдат, ул.Тугдона-6',
                'branch_user_id' => '650455697',
            ],
            [
                'id' => '8a5a251d-0795-11ea-9490-b06ebfbfa715',
                'code' => '001-017',
                'code_map' => '6955115148',
                'acc_number' => '40404972600170000011',
                'name' => 'Филиали ЧСК "Бонки Эсхата" дар райони Хисор',
                'address' => 'г. Хисор, ул.И.Сомони 2',
                'branch_user_id' => '1081026548',
            ],
            [
                'id' => '8d043449-0795-11ea-9490-b06ebfbfa715',
                'code' => '001-018',
                'code_map' => '6954730713',
                'acc_number' => '40404972000180000012',
                'name' => 'Филиали ЧСК "Бонки Эсхата" дар ш. Кургон-Тепа',
                'address' => 'г. Кургонтеппа, УЛ. ВАХДАТ, 9',
                'branch_user_id' => '1690588818',
            ],
            [
                'id' => '8fad6f81-0795-11ea-9490-b06ebfbfa715',
                'code' => '001-019',
                'code_map' => '6954585855',
                'acc_number' => '40404972000190000015',
                'name' => 'Филиали ЧСК "Бонки Эсхата" дар н. Джайхун',
                'address' => 'Кумсангир, ул. 1 май 26',
                'branch_user_id' => '2472460599',
            ],
            [
                'id' => '94585e73-0795-11ea-9490-b06ebfbfa715',
                'code' => '001-020',
                'code_map' => '6954616574',
                'acc_number' => '40404972100200000012',
                'name' => 'Филиали ЧСК "Бонки Эсхата" дар н.Б.Гафуров',
                'address' => 'Б. Гафуровский район, ул. Ленина 3',
                'branch_user_id' => '1776070206',
            ],
            [
                'id' => '96fc3ee4-0795-11ea-9490-b06ebfbfa715',
                'code' => '001-021',
                'code_map' => '6954528062',
                'acc_number' => '40404972100210000015',
                'name' => 'Филиали ЧСК "Бонки Эсхата" дар ш.Кулоб',
                'address' => 'г. Кулоб, ул. И. Сомони 21',
                'branch_user_id' => '2580942259',
            ],
            [
                'id' => '99b9a53d-0795-11ea-9490-b06ebfbfa715',
                'code' => '001-022',
                'code_map' => '6954507142',
                'acc_number' => '40404972900220000014',
                'name' => 'Филиали ЧСК "Бонки Эсхата" дар н.Спитамен',
                'address' => 'г. Спитамен, ул. Ленина 54а',
                'branch_user_id' => '2958700548',
            ],
            [
                'id' => '9ce6967d-0795-11ea-9490-b06ebfbfa715',
                'code' => '001-023',
                'code_map' => '6954206232',
                'acc_number' => '40404972400230000012',
                'name' => 'Филиали ЧСК "Бонки Эсхата" дар н.Рудаки',
                'address' => 'Район Рудаки, ул. И. Сомони',
                'branch_user_id' => '2987281720',
            ],
            [
                'id' => '9fee8044-0795-11ea-9490-b06ebfbfa715',
                'code' => '001-024',
                'code_map' => '6954864222',
                'acc_number' => '40404972400240000015',
                'name' => 'Филиали ЧСК "Бонки Эсхата" дар н.Шохмансур',
                'address' => 'г. Душанбе, Шохмансур, ул. Адхамов 11',
                'branch_user_id' => '3922423365',
            ],
            [
                'id' => 'a22b5856-0795-11ea-9490-b06ebfbfa715',
                'code' => '001-100',
                'code_map' => '6911983790',
                'acc_number' => '40404972800010000007',
                'name' => 'ЧСК "Бонки Эсхата" дар ш.Хучанд (ИДОРАИ АМАЛИЕТИ)',
                'address' => 'г. Хучанд, ул. Гагарина 135',
                'branch_user_id' => '8935396',
            ],
        ];

        foreach ($vars as $var) {
            try {
                Branch::create(['id' => $var['id']], $var);
                //Branch::updateOrCreate(['id' => $var['id']], $var);
                //TransactionSyncRule::create($var);
            } catch (\Exception $e) {
                $this->logger->error($e->getMessage());
            }
        }
    }
}
