<?php

use App\Models\DocumentType\DocumentType;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\Log;

class DocumentTypesTableSeeder extends Database\Seeds\BaseSeeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $items = [
            ['id' => '0b4a8bd0-0e7e-11e9-91d8-b06ebfbfa715', 'code' => '1', 'code_map' => '1920683', 'name' => 'Вид', 'desc' => 'Вид на жительство'],
            ['id' => '0b4a8c09-0e7e-11e9-91d8-b06ebfbfa715', 'code' => '2', 'code_map' => '9303032', 'name' => 'Виза', 'desc' => 'Виза'],
            ['id' => '0b4a8c1a-0e7e-11e9-91d8-b06ebfbfa715', 'code' => '3', 'code_map' => '7129337950', 'name' => 'Вод. права', 'desc' => 'Шаходатномаи ронандаги'],
            ['id' => '0b4a8c2b-0e7e-11e9-91d8-b06ebfbfa715', 'code' => '4', 'code_map' => '1920688', 'name' => 'Военный билет', 'desc' => 'Военный билет офицера запаса'],
            ['id' => '0b4a8c39-0e7e-11e9-91d8-b06ebfbfa715', 'code' => '5', 'code_map' => '1920685', 'name' => 'Врем. удостов.', 'desc' => 'Врем. удостов. личности гражд. РТ'],
            ['id' => '0b4a8c48-0e7e-11e9-91d8-b06ebfbfa715', 'code' => '6', 'code_map' => '7785883877', 'name' => 'Гув. икомат барои шахр. хор. дар ЧТ', 'desc' => 'Гувохномаи икомат барои шахрванди хоричи дар ЧТ'],
            ['id' => '0b4a8c59-0e7e-11e9-91d8-b06ebfbfa715', 'code' => '7', 'code_map' => '1920680', 'name' => 'Дипломатич.', 'desc' => 'Дипломатический паспорт гражд. РФ'],
            ['id' => '0b4a8c67-0e7e-11e9-91d8-b06ebfbfa715', 'code' => '8', 'code_map' => '1920675', 'name' => 'Загранпаспорт', 'desc' => 'Загранпаспорт гражданина СССР'],
            ['id' => '0b4a8c75-0e7e-11e9-91d8-b06ebfbfa715', 'code' => '9', 'code_map' => '1920686', 'name' => 'Загранпаспорт РФ', 'desc' => 'Загранпаспорт гражданина РФ'],
            ['id' => '0b4a8c86-0e7e-11e9-91d8-b06ebfbfa715', 'code' => '10', 'code_map' => '9303033', 'name' => 'Иной документ', 'desc' => 'Иной документ, подтверждающий право на проживание'],
            ['id' => '0b4a8c94-0e7e-11e9-91d8-b06ebfbfa715', 'code' => '11', 'code_map' => '1920672', 'name' => 'Иные докум.', 'desc' => 'Иные докум., выдаваемые органами МВД'],
            ['id' => '0b4a8ca3-0e7e-11e9-91d8-b06ebfbfa715', 'code' => '12', 'code_map' => '1920679', 'name' => 'Минморфлот', 'desc' => 'Паспорт Минморфлота'],
            ['id' => '0b4a8cb4-0e7e-11e9-91d8-b06ebfbfa715', 'code' => '13', 'code_map' => '1920671', 'name' => 'Паспорт', 'desc' => 'Паспорт гражданина СССР'],
            ['id' => '0b4a8cc2-0e7e-11e9-91d8-b06ebfbfa715', 'code' => '14', 'code_map' => '1920687', 'name' => 'Паспорт моряка', 'desc' => 'Паспорт моряка'],
            ['id' => '0b4a8cd0-0e7e-11e9-91d8-b06ebfbfa715', 'code' => '15', 'code_map' => '1920673', 'name' => 'Паспорт РФ', 'desc' => 'Паспорт гражданина РФ'],
            ['id' => '0b4a8cde-0e7e-11e9-91d8-b06ebfbfa715', 'code' => '16', 'code_map' => '9303031', 'name' => 'Разрешение', 'desc' => 'Разрешение на временное проживание'],
            ['id' => '0b4a8cef-0e7e-11e9-91d8-b06ebfbfa715', 'code' => '17', 'code_map' => '1920676', 'name' => 'Свидетельство', 'desc' => 'Шаходатномаи таваллуд'],
            ['id' => '0b4a8cfe-0e7e-11e9-91d8-b06ebfbfa715', 'code' => '18', 'code_map' => '1920682', 'name' => 'Свидетельство', 'desc' => 'Свидетельство о регистрации ходатайства'],
            ['id' => '0b4a8d0c-0e7e-11e9-91d8-b06ebfbfa715', 'code' => '19', 'code_map' => '1820605491', 'name' => 'Сертификат', 'desc' => 'Сертификат М1'],
            ['id' => '0b4a8d1a-0e7e-11e9-91d8-b06ebfbfa715', 'code' => '20', 'code_map' => '1885755649', 'name' => 'Сертификат', 'desc' => 'Свидетельство о прохождении крат.курса "PR-менед"'],
            ['id' => '0b4a8d2b-0e7e-11e9-91d8-b06ebfbfa715', 'code' => '21', 'code_map' => '1900592548', 'name' => 'Сертификат', 'desc' => 'Сертификат "Лаборотория Касперского"'],
            ['id' => '0b4a8d39-0e7e-11e9-91d8-b06ebfbfa715', 'code' => '22', 'code_map' => '1900593170', 'name' => 'Сертификат', 'desc' => 'Сертификат о прохождении курса "ИБ в банках"'],
            ['id' => '0b4a8d4a-0e7e-11e9-91d8-b06ebfbfa715', 'code' => '23', 'code_map' => '1903833989', 'name' => 'Сертификат', 'desc' => 'Сертификат менеджера системы менеджмента качества'],
            ['id' => '0b4a8d59-0e7e-11e9-91d8-b06ebfbfa715', 'code' => '24', 'code_map' => '1951568087', 'name' => 'Сертификат', 'desc' => 'Сертификат об окончании курса'],
            ['id' => '0b4a8d67-0e7e-11e9-91d8-b06ebfbfa715', 'code' => '25', 'code_map' => '1975240637', 'name' => 'Сертификат', 'desc' => 'Сертификат Построение систем IP-телефонии на базе'],
            ['id' => '0b4a8d72-0e7e-11e9-91d8-b06ebfbfa715', 'code' => '26', 'code_map' => '1975395549', 'name' => 'Сертификат', 'desc' => 'Сертификат об окончании курса'],
            ['id' => '0b4a8d80-0e7e-11e9-91d8-b06ebfbfa715', 'code' => '27', 'code_map' => '2446401816', 'name' => 'Сертификат', 'desc' => 'Сертификат об успешно прошедшем экзамене'],
            ['id' => '0b4a8d8f-0e7e-11e9-91d8-b06ebfbfa715', 'code' => '28', 'code_map' => '1920678', 'name' => 'Справка', 'desc' => 'Справка об освобождении из места лишения свободы'],
            ['id' => '0b4a8d9d-0e7e-11e9-91d8-b06ebfbfa715', 'code' => '29', 'code_map' => '6853500', 'name' => 'Справка о смерти', 'desc' => 'Справка о смерти'],
            ['id' => '0b4a8dab-0e7e-11e9-91d8-b06ebfbfa715', 'code' => '30', 'code_map' => '1920677', 'name' => 'Удостоверение', 'desc' => 'Удостоверение личности офицера'],
            ['id' => '0b4a8db9-0e7e-11e9-91d8-b06ebfbfa715', 'code' => '31', 'code_map' => '1920674', 'name' => 'Хуччати тасд. шахс.хизматчии харби', 'desc' => 'Хуччати тасдиккунандаи шахсияти хизматчии харби'],
            ['id' => '0b4a8dca-0e7e-11e9-91d8-b06ebfbfa715', 'code' => '32', 'code_map' => '7787042086', 'name' => 'Шаход.  хиз. корм. макомотхо', 'desc' => 'Шаходатномаи  хизматии  кормандони  макомотхо'],
            ['id' => '0b4a8dd9-0e7e-11e9-91d8-b06ebfbfa715', 'code' => '33', 'code_map' => '7755207745', 'name' => 'Шаходатномаи бозгашт ба ЧТ', 'desc' => 'Шаходатномаи бозгашт ба Чумхурии Точикистон'],
            ['id' => '0b4a8de7-0e7e-11e9-91d8-b06ebfbfa715', 'code' => '34', 'code_map' => '1920684', 'name' => 'Шаходатномаи гуреза', 'desc' => 'Шаходатномаи гуреза'],
            ['id' => '0b4a8df5-0e7e-11e9-91d8-b06ebfbfa715', 'code' => '35', 'code_map' => '7785859068', 'name' => 'Шаходатномаи мув. панохчуянда', 'desc' => 'Шаходатномаи муваккатии панохчуянда'],
            ['id' => '0b4a8e03-0e7e-11e9-91d8-b06ebfbfa715', 'code' => '36', 'code_map' => '7754997551', 'name' => 'Шаходатномаи ронандаги', 'desc' => 'Шаходатномаи ронандаги'],
            ['id' => '0b4a8e14-0e7e-11e9-91d8-b06ebfbfa715', 'code' => '37', 'code_map' => '7754971613', 'name' => 'Шаходатномаи шахси бешахрванд', 'desc' => 'Шаходатномаи шахси бешахрванд'],
            ['id' => '0b4a8e20-0e7e-11e9-91d8-b06ebfbfa715', 'code' => '38', 'code_map' => '7093387644', 'name' => 'Шиносномаи дипломатии ЧТ', 'desc' => 'Шиносномаи дипломати шахрванди Чумхурии Точикистон'],
            ['id' => '0b4a8e2e-0e7e-11e9-91d8-b06ebfbfa715', 'code' => '39', 'code_map' => '7754895944', 'name' => 'Шиносномаи хизматии шахрванди ЧТ', 'desc' => 'Шиносномаи хизматии шахрванди Чумхурии Точикистон'],
            ['id' => '0b4a8e3c-0e7e-11e9-91d8-b06ebfbfa715', 'code' => '40', 'code_map' => '10604025', 'name' => 'Шиносномаи хоричии ЧТ', 'desc' => 'Шиносномаи хоричии шахрванди Чумхурии Точикистон'],
            ['id' => '0b4a8e4a-0e7e-11e9-91d8-b06ebfbfa715', 'code' => '41', 'code_map' => '10604024', 'name' => 'Шиносномаи ЧТ', 'desc' => 'Шиносномаи шахрванди Чумхурии Точикистон'],
            ['id' => '0b4a8e59-0e7e-11e9-91d8-b06ebfbfa715', 'code' => '42', 'code_map' => '1920681', 'name' => 'Шиносномаи шахрванди хоричи', 'desc' => 'Шиносномаи шахрванди хоричи'],

        ];

        foreach ($items as $item) {
            try {
                $res = DocumentType::create($item);
            } catch (\Exception $e) {
                $this->logger->error($e->getMessage());
            }
        }

    }
}
