<?php

return [
    'backend' => [
        'id' => 'ID',
        'title' => 'Кэшбэк элемент',
        'name' => 'Название',
        'min' => 'Интервал от',
        'max' => 'Интервал до',
        'value' => 'Сумма',
        'is_percentage' => 'Является ли значение поля "Сумма" процентом',
        'cashback_id' => 'Кэшбэк',
        'is_active' => 'Статус',
        'created_at' => 'Создан',
        'updated_at' => 'Изменен',
        'table' => [
            'id' => 'ID',
            'title' => 'Кэшбэк элемент',
            'name' => 'Название',
            'min' => 'Интервал от',
            'max' => 'Интервал до',
            'value' => 'Сумма',
            'is_percentage' => 'Является ли значение поля "Сумма" процентом',
            'cashback_id' => 'Кэшбэк',
            'is_active' => 'Статус',
            'created_at' => 'Создан',
            'updated_at' => 'Изменен',
        ]
    ]
];
