<?php

return [
    'backend' => [
        'title' => 'Категории',
        'code' => 'Код',
        'name' => 'Название категории',
        'parent_id' => 'Родитель',
        'is_active' => 'Статус активности',
        'position' => 'Позиция(Порядковый номер)',
        'is_enabled' => 'Статус доступности для неидентифицированных',
        'created_at' => 'Создан',
        'updated_at' => 'Изменен',
        'icon_url' => 'Иконка',
        'is_searchable' => 'Доступен для поиска',
        'table' => [
            'title' => 'Категории',
            'code' => 'Код',
            'name' => 'Название категории',
            'parent_id' => 'Родитель',
            'is_active' => 'Статус активности',
            'is_enabled' => 'Статус',
            'icon_url' => 'Иконка',
            'position' => 'Позиция(Порядковый номер)',
            'is_searchable' => 'Доступен для поиска',
            'created_at' => 'Создан',
            'updated_at' => 'Изменен',
        ],
    ],
    'errors' => [
        'not_found' => 'Категория не найдена.',
        'size_not_found' => 'Размер не найден.',
        'tree_build_failed' => 'Ошибка при построении структуры категорий.',
    ],
];
