<?php

return [
    'backend' => [
        'title' => 'Избранные контакты пользователей',
        'id' => 'Код',
        'name' => 'Название',
        'value' => 'Значение',
        'params_json' => 'Параметры',
        'service_id' => 'Сервис',
        'user_id' => 'Пользователь',
        'created_at' => 'Создан',
        'updated_at' => 'Изменен',

        'table' => [
            'title' => 'Избранные контакты пользователей',
            'id' => 'Код',
            'name' => 'Название',
            'value' => 'Значение',
            'params_json' => 'Параметры',
            'service_id' => 'Сервис',
            'user_id' => 'Пользователь',
            'created_at' => 'Создан',
            'updated_at' => 'Изменен',
        ],
    ],
    'errors' => [
        'not_found' => 'Шаблон не найден.',
    ],
];
