<?php

return [
    'title' => 'Настройки и переменные среды',
    'key' => 'Ключ',
    'id' => 'Номер',
    'value' => 'Значение',
    'backend' => [
        'title' => 'Настройки и переменные среды',
        'key' => 'Ключ',
        'id' => 'Номер',
        'value' => 'Значение',

    ],
    'errors' => [
        'not_found' => 'Данная опция не доступна.',
        'major_update' => 'Требуется обновление приложения! Просим обновиться чтобы пользоваться новыми возможностями.', // upgrade_app_status: 3
        'minor_update' => 'Рекомендуется обновить приложение.', // upgrade_app_status: 2
        'patch_update' => 'Вышло обновление приложения.', // upgrade_app_status: 1
    ],
];
